# Name Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalService..::..Name Property
ExternalService Class See Also
---
The name of the service
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string Name { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Name As String
	Get
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
}
```

# See Also
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace